package lesson_02.homework_02;

public class Task_1 {
    public static void main(String[] args) {

        //Дано: Хитрый бухгалтер разделил 5 рублей на 2 кассы. Сколько рублей лежит в каждой кассе?
//Вывести на консоль
        int x=5; //некий мешок денег с 5 рублями
        int c = 2; //количество касс
        System.out.println("по "+x/c +" рубля в каждой кассе (точно есть)");//выводим в консоль результат деления денег между кассами
        System.out.println("хотя вообще не факт, конечно, ведь мы не знаем сколько денег в кассах было до этого действия");

    }




}
