package lesson_02.homework_02;

public class Task_2 {
    public static void main(String[] args) {
        //Задача 2. Дано: Стороны квадрата a = 50, b = 20. Найти площадь.
        //Вывести на консоль
        int a, b; //объявим переменные длины и ширины

        //инициализируем переменные
        a=50;
        b=20;
        //выводим площадь в консоль
        System.out.println("Площадь квадрата="+a*b);

    }
}
